app/Controllers/Admin.php

	public function dataAdmin()
	{
		$type = $this->request->getGet('type');
		if ($type == "view") {
			$data = [
				"users" => $this->users->findAll(),
				"assetsPath" => "../assets/vuexy/assets/"
			];
			return view('admin/data_admin', $data);
		} else {
			if ($this->request->getMethod() == "post") {
				$nameUser = $this->request->getPost("nameUser");
				$emailUser = $this->request->getPost("emailUser");

				try {
					$this->users->insert([
						'email' => $emailUser,
						'name' => $nameUser,
						'password' => password_hash("kamandaka123", PASSWORD_BCRYPT)
					]);
---
SELECT *
FROM `users`
INSERT INTO `users` (`email`, `name`, `password`) VALUES ('raden@kamandaka', 'raden', '$2y$10$B7z1g79HUSXe/EhAgf5n5O4cstakqtBY8X0CsOY3JNhAB2.97ap02')

	public function dataSupir()
	{
		$type = $this->request->getGet('type');
		if ($type == "view") {
			$data = [
				"users" => $this->drivers->findAll(),
				"assetsPath" => "../assets/vuexy/assets/"
			];
---
SELECT *
FROM `drivers`

	public function members()
	{
		$data = [
			"members"=> $this->members->findAll(),
			"assetsPath" => "../assets/vuexy/assets/"
		];
---
SELECT *
FROM `members`