app/Controllers/Home.php

SELECT *
FROM `rental`
WHERE `status` != 'highlight'
SELECT *
FROM `rental`
WHERE `status` = 'highlight'
 LIMIT 1
SELECT *
FROM `reviews`
---
	public function index()
	{
		$sendData = [
			'dataMeta' => $this->anyHelpers->createMeta()->getMeta(),
			'daftarRental' => $this->AdtModel->where('status !=', 'highlight')->findAll(),
			'highlight' => $this->AdtModel->where('status', 'highlight')->first(),
			'reviews' => $this->Reviews->findAll()

SELECT *
FROM `rental`
WHERE `idMobil` = 'alphard'
 LIMIT 1
---
	public function rental($id = null)
	{
		if ($id != null) {
			$sendData = [
				'dataMeta' => $this->anyHelpers->createMeta('rental', $id)->getMeta(),
				'id' => $id,
				'rental' => $this->AdtModel->where('idMobil', $id)->first()